---
kind: property
id: P:Autodesk.Revit.DB.ImageInstance.LockProportions
source: html/2eda8038-9240-00f5-ffa3-a65d8b4df5f2.htm
---
# Autodesk.Revit.DB.ImageInstance.LockProportions Property

When true the proportion of Width to Height will be maintained

## Syntax (C#)
```csharp
public bool LockProportions { get; set; }
```